{
  "blogs": [
    {
      "id": "5a6d",
      "username": "Rohit Sharma",
      "location": "Mumbai, Maharastra",
      "blog": "I'm very, very happy for Jitesh – Abhinav Mukund heaps praise on RCB captain for match-winning knock against LSG\n\nJitesh Sharma’s marvellous innings of 85* against LSG got the cricketing world buzzing. Sharma walked out to bat at a very tricky juncture and needed to come up with a solid counterblast in order to steady the ship for RCB. Not only did he play the role of an aggressor but his partnership with Mayank Agarawal ensured that RCB eventually got across the line.\n\nTalking on the ESPNCricinfo Timeout, Indian cricketer Abhinav Mukund opened up on how Jitesh Sharma’s knock against LSG defined RCB’s dominance. He also explained how RCB learnt their lesson from their last game against SRH and instead of wilting under the pump, they fought back like true warriors.\n\nMukund said, “And that's a great sign of any IPL cricketer, right? They were 172 for 3 in the last game, chasing 232, they got 189 all out. I know the wickets fell before him, but the pressure increased in the last game right after the timeout. I feared the same when he got out of that no-ball, but luck is a beautiful thing there. You get a reprieve and then you say, 'okay, this time I'm not making a mistake again.’”\n\nHe further added, “That's exactly what happened. I'm very, very happy for Jitesh, but this is exactly what you're paying the big bucks for as a mid-order batter. And he's proven that a plenty. On a night when your top wicketkeeper or your World Cup wicketkeeper [Pant] gets a hundred and everyone's happy, this guy's got one better, I would think, with 85* off 33.\"",
      "date": "5/31/2025, 6:14:41 PM"
    },
    {
      "id": "b2cd",
      "username": "Suyash Sharma",
      "location": "RCB camp, Bengaluru",
      "blog": "RCB clash with PBKS in high-stakes first qualifier of IPL 2025\n\nAfter a rampant run in the league stages, the play-offs are finally here for RCB to showcase their magic and flair. In what is going to be a high-stakes battle, the Royal Challengers Bengaluru will be locking horns with the Punjab Kings for the third time in the tournament. The spoils in this year’s rivalry have so far been shared with Punjab winning the tie in Chinnaswamy after the rain gods played spoilsport while RCB redeemed themselves in the latter’s den.\n\nWith nine wins from 14 games, RCB racked up 19 points in the group stages. Punjab Kings also stood on a similar front with identical statistics. Both the teams will be coming on the back of a win as RCB roared past LSG in a high-scoring thriller while Punjab humbled MI in a runfest at Sawai Mansingh Stadium.\n\nBoth the teams come in with excellent firepower despite a few maneuvers. RCB will be without Jacob Bethell and Lungi Ngidi who have gone back home for international duties. Punjab Kings will also not be able to avail the services of Marco Jansen who has returned to South Africa due to national duties. In all likelihood, Josh Hazlewood is going to be back for RCB after a brief injury scare.\n\nDespite the hits and misses, one can expect this contest to be a cracker of the highest order. With the presence of two of India’s finest, Virat Kohli and Shreyas Iyer, one can expect this to be a full-blown run-fest, featuring a handful of heavy-hitters laced with incredible rising sensation.\n\nVenue Watch\n\nThe surface in New Chandigarh has been a mix of all elements that make the first qualifier a spicy one. The first two games in the venue saw three 200 plus totals while the other two had modest scores, one of which witnessed a 95 all out. With a hint of spongy bounce, a batter needs to be watchful before one can play his shot, Tactical flair will be the key to score on the track.\n\nMatch detail:\n\nMatch: Punjab Kings vs Royal Challengers Bengaluru\n\nVenue: Maharaja Yadavindra Singh International Cricket Stadium, New Chandigarh\n\nDate: 29th May, 2025\n\nTime: 7:30 PM\n\nHead-to-head:\n\nMatches played: 35\n\nRCB: 17\n\nPBKS: 18\n\nSquads:\n\nRoyal Challengers Bengaluru:\n\nPhilip Salt, Virat Kohli, Mayank Agarawal, Rajat Patidar(c), Liam Livingstone, Jitesh Sharma(w), Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Yash Dayal, Nuwan Thushara, Suyash Sharma, Josh Hazlewood, Tim Seifert, Rasikh Dar Salam, Manoj Bhandage, Swapnil Singh, Blessing Muzarabani, Tim David, Mohit Rathee, Swastik Chikara, Abhinandan Singh\n\nPunjab Kings:\n\nPriyansh Arya, Prabhsimran Singh, Josh Inglis(w), Shreyas Iyer(c), Nehal Wadhera, Shashank Singh, Marcus Stoinis, Harpreet Brar, Kyle Jamieson, Arshdeep Singh, Vijaykumar Vyshak, Yuzvendra Chahal, Suryansh Shedge, Musheer Khan, Xavier Bartlett, Praveen Dubey, Azmatullah Omarzai, Vishnu Vinod, Yash Thakur, Aaron Hardie, Kuldeep Sen, Mitchell Owen, Harnoor Singh, Pyla Avinash",
      "date": "5/31/2025, 6:16:55 PM"
    },
    {
      "id": "3a37",
      "username": "Abhishek Sharma",
      "location": "Amritsar, Punjab",
      "blog": "Great feeling right now – Phil Salt on RCB’s impressive win against PBKS\n\nOn a surface that had its fair shares of trickery, it needed an anchor for RCB to see off what was a modest total that they were shooting down. Phil Salt spearheaded the charge for RCB after they lost Virat Kohli early. There were early signs of explosive lateral drift from Kyle Jamieson and Azmatullah Omarzai but they all were rendered blunt in front of Salt’s unchecked aggression.\n\nThe English opener registered his fastest half-century of IPL while staying unbeaten for a 27-ball-56, propelling RCB across the finish line. Salt whacked six fours and three sixes to provide the all-important shot in the arm for the Royal Challengers as they cruised past PBKS.\n\nTalking at the post-match presentation, Salt revealed what was going on in his mind early on and his important conversation with Andy Flower.\n\nShedding light on the wicket that hosted the first qualifier, Salt said, “Great feeling right now, it (the ball) did move a bit. I think that was not the worst wicket to have played on in this season.”\n\nHe also talked about the immediate strategy that he had in mind when he walked out to bat, stating, “Don't get out to Arshdeep, we played 2 group games (with PBKS) and he's found different ways to get me out, so was just trying to react to the ball.”\n\nRevealing what his conversation with Andy Flower was like, Salt said, “I said before the game to Andy (Flower) that was the blessing in disguise for us (talking about the travel and breaks in between games). (This win) Gives us the momentum, it is a cliche but true, that's what you want at the backend of the tournament, want to hit your straps and play a part with the bat or ball.”",
      "date": "5/31/2025, 6:18:42 PM"
    },
    {
      "id": "4835",
      "username": "Swastik Chikara",
      "location": "Gurgaon, Hariyana",
      "blog": "One more game and let's celebrate together – Rajat Patidar on RCB’s clinical win against PBKS\nRCB carved history in New Chandigarh as they registered the biggest win in a Playoff game in terms of balls remaining.\n\nThanks to Phil Salt, RCB shot down the required total of 102 in just 10 overs while Rajat Patidar chimed in with a crucial finish touch as he slog-swept Musheer Khan over the deep square leg fielder for the winning runs.\n\nTalking at the post-match presentation, Rajat Patidar was all praise about his team. He spoke on the entire fast-bowling unit and then shifted his attention to Suyash Sharma’s incredible spell.\n\nUnderlining the impressive start by the fast bowlers, Rajat Patidar said, “I think we were clear in our plans, how we have to bowl. I think the fast bowlers used the surface really well.”\n\nPatidar then shifted his focus to Suyash Sharma, adding, “The way Suyash chipped in, the way he bowled his lines and lengths, that was really good. As a captain I am clear about his bowling. He has to target the stumps, that's his strength. His wrong 'un is difficult to read for the batters. I always want to give him clear ideas, I don't want to confuse him. I am okay if he concedes a few runs (in the process.)”\n\nHe also shared plaudits for Phil Salt, underlining the importance of the massive starts that he has given so far that has helped RCB to create a monumental platform for a later flourish throughout the tournament.\nHighlighting Salt’s stellar striking, Patidar said, “We have had a lot of practice sessions throughout the tournament, so one day of not practising won't harm you. The way he (Salt) is batting in most of the matches. The way he is giving starts, I am a big fan of him. It's a treat to watch him from the dugout. That's really good.”\n\nThe RCB skipper concluded with a word for the fans, stating. “I always thank RCB fans, not only in Chinnaswamy, but wherever we go we feel it's our home ground. We love you, so keep supporting us. One more game and let's celebrate together.”",
      "date": "5/31/2025, 6:20:15 PM"
    },
    {
      "id": "437b",
      "username": "Jitesh Sharma",
      "location": "RCB camp, Bengaluru",
      "blog": "My coaches gave me just one role – Jitesh Sharma opens up on the clarity in RCB’s win against PBKS\n\nMy coaches gave me just one role – Suyash Sharma opens up on the clarity in RCB’s win against PBKS\n30 May, 2025\nEditor\nSuyash Sharma\nAn incredible spell from Suyash Sharma saw the young leggie run through the PBKS ranks in Qualifier 1 of IPL 2025, allowing RCB to set up an easy chase for themselves which saw them sail through to the finals.\n\nSharma claimed the prized scalps of Shashank Singh, Musheer Khan and Marcus Stoinis, PBKS’ best hope for the day with the bat.\n\nHe won the Player of the Match award for his phenomenal performance against PBKS. Talking at the post-match presentation, Suyash Sharma opened up on the support that he received from his coaches and it was the same clarity that helped him deliver the payload in the qualifier.\n\nSuyash said, “My coaches gave me just one role, which is to hit the stumps whether I bowl legbreak, googly, flipper or any other variation. It (googly) is my stock ball and also I got a bit of help from the wicket as well.”\n\nHe concluded by shedding some light on the possible celebrations, adding, “Not quite now (whether he will be celebrating tonight), I will.”",
      "date": "5/31/2025, 6:30:43 PM"
    },
    {
      "id": "828c",
      "username": "Subhradeep Nath",
      "location": "Kolkata, West Bengal",
      "blog": "Drama! Drama! Drama!\nJitesh had made RCB overwhelming favourites by hitting Avesh for two fours in the 16th over. Rathi comes on for the 17th. Jitesh goes reverse and gets caught at backward point. Rathi starts writing on the ground in celebration but it's a low catch and the on-field umpires want the TV umpire to have a look. But even before the third umpire gets there, he finds that Rathi has bowled a back-foot no-ball.\n\nJitesh gives his all to the free hit and sends it over deep midwicket. That takes him to his fifty too, surprisingly his first in the IPL.\n\nAs Rathi runs in to bowl the final ball, he breaks the stumps at the non-striker's end. Jitesh is out of his crease at that point. The umpire checks with Rathi if he is appealing and Rathi replies in the affirmative. The TV umpire rules it not out, saying Rathi had completed his \"delivery stride\" before affecting the run out. Not out flashes on the big screen. In the meantime, Pant had withdrawn the appeal.\n\n\n\n",
      "date": "5/31/2025, 6:34:51 PM"
    },
    {
      "id": "a147",
      "username": "Unknown",
      "location": "Ranchi,Jharkhand",
      "blog": "Kohli fifty keeps RCB in hunt.\n\nKohli chips Shahbaz over his head for a four before hitting Akash through covers on the up. That second four takes him to his fifty off 27 balls, and RCB to their hundred.\n\nAgarwal then hits a hat-trick of fours, first cutting, then pulling and then cutting again.\n\nRCB 115/3 after ten. They need 113 more from the remaining ten.",
      "date": "5/31/2025, 6:36:37 PM"
    },
    {
      "id": "290a",
      "username": "Romario Shephard",
      "location": "Jamaica, West Indies",
      "blog": "RCB 50/0 after four\n\nLSG immediately bring spin on from both ends. Digvesh Rathi bowls the third over and Shahbaz Ahmed the fourth. It limits the damage somewhat as only 19 come from those two. Both Kohli and Salt are batting with a strike rate of 200-plus. Salt has also completed 7000 T20 runs.",
      "date": "5/31/2025, 6:38:16 PM"
    },
    {
      "id": "fdb0",
      "username": "Rajat Patidar",
      "location": "Chambal ,MP",
      "blog": "Live Report - RCB sniff final after bowling PBKS for 101\nRoyal Challengers Bengaluru waltzed their way into their first IPL final since 2016 as they blew away Punjab Kings for 101 on a surface with seam and extra bounce. Batting didn’t get any easier in the second innings, but Phil Salt broke the back of the small chase in the powerplay that went for 61 despite a wicket-maiden in it.\nThe RCB fast bowlers kept bashing the hard lengths as PBKS refused to dial down the aggression on the challenging surface, taking seven wickets between them. The legspinner Suyash Sharma was the beneficiary of some reckless sweeping; they didn’t pick any of the wrong’uns, losing three wickets to him. The ball bounced and moved more in the second innings than the first, just the time for Salt to unleash his quickest fifty in the IPL, off just 23 balls, to take RCB home with a whole 10 overs to spare.",
      "date": "5/31/2025, 6:46:46 PM"
    },
    {
      "id": "3d09",
      "username": "Baibhab Roy",
      "location": "Bhagalpur, Bihar",
      "blog": "Royal Challengers Bengaluru waltzed their way into their first IPL final since 2016 as they blew away Punjab Kings for 101 on a surface with seam and extra bounce. Batting didn’t get any easier in the second innings, but Phil Salt broke the back of the small chase in the powerplay that went for 61 despite a wicket-maiden in it.\nThe RCB fast bowlers kept bashing the hard lengths as PBKS refused to dial down the aggression on the challenging surface, taking seven wickets between them. The legspinner Suyash Sharma was the beneficiary of some reckless sweeping; they didn’t pick any of the wrong’uns, losing three wickets to him. The ball bounced and moved more in the second innings than the first, just the time for Salt to unleash his quickest fifty in the IPL, off just 23 balls, to take RCB home with a whole 10 overs to spare.",
      "date": "5/31/2025, 6:48:07 PM"
    },
    {
      "id": "c5bb",
      "username": "Kartik Ariyan",
      "location": "Mohali, Punjab",
      "blog": "RCB in their fourth final\nWith a massive slog-sweep off Musheer Khan's left-arm spin, Rajat Patidar seals RCB's progress into the final with a whole 10 overs to spare. Phil Salt is unbeaten on 56 off 27.\n\nPBKS have another shot at making the final. Knowing what we know now, it was actually a good toss to lose for PBKS. The ball did more in the second innings than in the first, but PBKS just didn't have the runs to play with. Should they have used their experience of 111 all out previously and tried to be more measured and adjust their sights? Easy to say in hindsight. This is where experience comes into play.",
      "date": "5/31/2025, 6:49:17 PM"
    },
    {
      "id": "958d",
      "username": "Taranath Tantrik",
      "location": "Barddhaman, West Bengal",
      "blog": "On this brutish pitch, the ball has moved and bounced more in the second innings than in the first. What a time then for Phil Salt to score his quickest fifty in the IPL: just 23 balls. The win is a mere formality now. hhhhhhhhhhhhhhhhhhhh\n",
      "date": "5/31/2025, 6:50:10 PM"
    },
    {
      "id": "6c3b",
      "username": "Subhradeep Nath",
      "location": "Bengaluru, Karnataka",
      "blog": "RCB creates history by winning their maiden IPL title after 18 years.\n03.06.2025- World RCB day\n",
      "date": "6/5/2025, 12:21:26 AM"
    },
    {
      "id": "aae3",
      "username": "Anurag",
      "location": "Kolkata",
      "blog": "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
      "date": "6/22/2025, 7:07:40 PM"
    }
  ]
}